Repository: lovitus/processgod-mac
Catalog: macos/ProcessGodMac/Localizable.xcstrings
Source language: en
Languages: zh_hans

# app.quit
source: Quit ProcessGod
zh_hans: 退出 ProcessGod

source: Guardian connected
zh_hans: 守护进程已连接

# guardian.degraded
source: Guardian needs attention
zh_hans: 守护进程需要处理

# guardian.pause
source: Pause All
zh_hans: 暂停全部

# guardian.resume
source: Resume All
zh_hans: 恢复全部

# service.user.short
source: User
zh_hans: 用户级

# service.system.short
source: System
zh_hans: 系统级

# service.user
source: After login (User)
zh_hans: 登录后启动（用户级）

# service.system
source: Before login (System)
zh_hans: 登录前启动（系统级）

# service.approvalRequired
source: Administrator approval is required in System Settings.
zh_hans: 需要在系统设置中由管理员批准。

# service.openSettings
source: Open System Settings
zh_hans: 打开系统设置

# process.add
source: Add Process
zh_hans: 新增进程

# process.edit
source: Edit Process
zh_hans: 编辑进程

# process.delete
source: Delete Process
zh_hans: 删除进程

# process.enable
source: Enable Guard
zh_hans: 启用守护

# process.disable
source: Disable and Stop
zh_hans: 停用并停止

# process.restart
source: Restart Now
zh_hans: 立即重启

# process.logs
source: Memory Logs
zh_hans: 内存日志

# process.empty
source: No processes
zh_hans: 尚未配置进程

# process.empty.description
source: Add the first command you want ProcessGod to guard.
zh_hans: 新增第一个需要 ProcessGod 守护的命令。

# process.select
source: Select a process to edit
zh_hans: 选择一个进程进行编辑

# processes.title
source: Processes
zh_hans: 进程列表

# manager.open
source: Manage
zh_hans: 管理

# manager.title
source: Process Manager
zh_hans: 进程管理

# logs.title
source: Memory Logs
zh_hans: 内存日志

# logs.category
source: Log category
zh_hans: 日志分类

# logs.errorWarning
source: Error / Warning
zh_hans: 错误 / 警告

# logs.standardOther
source: Standard / Other
zh_hans: 标准 / 其他

# logs.memoryOnly
source: Memory only
zh_hans: 仅保存在内存

# logs.totalSeen
source: Total seen
zh_hans: 累计行数

# logs.lineLimit
source: Line limit
zh_hans: 单行上限

source: Logs unavailable
zh_hans: 日志不可用

# settings.title
source: Settings
zh_hans: 设置

# settings.startup
source: Startup Service
zh_hans: 启动服务

# settings.level
source: Startup level
zh_hans: 启动级别

# settings.path
source: Command PATH
zh_hans: 命令 PATH

# settings.language
source: Language
zh_hans: 语言

# language.system
source: Follow System
zh_hans: 跟随系统

# common.back
source: Back
zh_hans: 返回

# common.cancel
source: Cancel
zh_hans: 取消

# common.modify
source: Modify
zh_hans: 修改

# logs.openFull
source: Open Full Logs
zh_hans: 打开完整日志

# common.save
source: Save
zh_hans: 保存

# editor.basic
source: Command
zh_hans: 命令

# editor.name
source: Display name
zh_hans: 显示名称

# editor.command
source: Executable
zh_hans: 可执行文件

# editor.choose
source: Choose…
zh_hans: 选择…

# editor.arguments
source: Arguments
zh_hans: 启动参数

# editor.workingDirectory
source: Working directory
zh_hans: 工作目录

# editor.behavior
source: Behavior
zh_hans: 运行行为

# editor.mode
source: Mode
zh_hans: 模式

# editor.enabled
source: Enabled immediately
zh_hans: 立即启用

# editor.cron
source: Cron expression
zh_hans: Cron 表达式

# editor.cron.invalid
source: Invalid cron expression
zh_hans: Cron 表达式无效

# editor.environment
source: Environment Variables
zh_hans: 环境变量

# editor.environment.add
source: Add Variable
zh_hans: 新增变量

# editor.advanced
source: Advanced
zh_hans: 高级

# editor.id
source: Stable ID
zh_hans: 固定 ID

# mode.guard
source: Always Guard
zh_hans: 持续守护

# mode.once
source: Start Once
zh_hans: 仅运行一次

# mode.cronRun
source: Cron Run
zh_hans: Cron 启动

# mode.cronRestart
source: Cron Restart
zh_hans: Cron 重启

# state.disabled
source: Disabled
zh_hans: 已停用

# state.starting
source: Starting
zh_hans: 正在启动

# state.running
source: Running
zh_hans: 运行中

# state.waiting
source: Waiting
zh_hans: 等待启动

# state.completed
source: Completed
zh_hans: 已完成

# state.error
source: Error
zh_hans: 错误

# process.delete.confirm
source: Delete this process? This cannot be undone.
zh_hans: 删除这个进程？此操作无法撤销。

# error.adminRequired
source: System mode requires an administrator account.
zh_hans: 系统级模式需要管理员账户。

# error.permissionDenied
source: This account is not allowed to control the system daemon.
zh_hans: 当前账户无权控制系统守护进程。

# error.notBootstrapped
source: The system daemon has not completed owner setup.
zh_hans: 系统守护进程尚未完成所有者设置。

# error.invalidCron
source: The Cron expression is invalid.
zh_hans: Cron 表达式无效。

# error.duplicateID
source: A process with this stable ID already exists.
zh_hans: 此固定 ID 已被其他进程使用。

# error.notFound
source: The requested process no longer exists.
zh_hans: 请求的进程已不存在。

# error.daemonDegraded
source: The daemon is running but its configuration needs repair.
zh_hans: 守护进程正在运行，但配置需要修复。

# error.daemonUnavailable
source: The guardian daemon is not available.
zh_hans: 守护进程当前不可用。

# error.invalidResponse
source: The daemon returned an invalid IPC response.
zh_hans: 守护进程返回了无效的 IPC 响应。

# error.protocolMismatch
source: The app and daemon IPC versions are incompatible.
zh_hans: 应用与守护进程的 IPC 版本不兼容。

# error.helperMissing
source: The Go helper is missing from the application bundle.
zh_hans: 应用包中缺少 Go helper。

# error.migrationFailed
source: Service migration failed and the previous service was restored.
zh_hans: 服务迁移失败，已恢复原服务。

# error.revisionConflict
source: Configuration changed elsewhere. The latest version has been reloaded.
zh_hans: 配置已被其他操作修改，已重新加载最新版本。
